bbinet/Open-connect-box/Software/STM32F411CEU6/Inc/stm32f4xx_hal_conf.h
/**
 * @file stm32f4xx_hal_conf.h
 * @brief HAL configuration file
 */

#ifndef __STM32F4xx_HAL_CONF_H
#define __STM32F4xx_HAL_CONF_H

#ifdef __cplusplus
extern "C" {
#endif

/* ########################## Module Selection ############################## */
#define HAL_MODULE_ENABLED
#define HAL_CORTEX_MODULE_ENABLED
#define HAL_DMA_MODULE_ENABLED
#define HAL_FLASH_MODULE_ENABLED
#define HAL_GPIO_MODULE_ENABLED
#define HAL_PWR_MODULE_ENABLED
#define HAL_RCC_MODULE_ENABLED
#define HAL_UART_MODULE_ENABLED
#define HAL_PCD_MODULE_ENABLED

/* ########################## HSE/HSI Values ################################ */
#if !defined (HSE_VALUE)
  #define HSE_VALUE              ((uint32_t)25000000U)  /* Value of the External oscillator in Hz */
#endif

#if !defined (HSE_STARTUP_TIMEOUT)
  #define HSE_STARTUP_TIMEOUT    ((uint32_t)100U)       /* Time out for HSE start up, in ms */
#endif

#if !defined (HSI_VALUE)
  #define HSI_VALUE              ((uint32_t)16000000U)  /* Value of the Internal oscillator in Hz */
#endif

#if !defined (LSI_VALUE)
  #define LSI_VALUE              ((uint32_t)32000U)     /* LSI Typical Value in Hz */
#endif

#if !defined (LSE_VALUE)
  #define LSE_VALUE              ((uint32_t)32768U)     /* Value of the External Low Speed oscillator in Hz */
#endif

#if !defined (LSE_STARTUP_TIMEOUT)
  #define LSE_STARTUP_TIMEOUT    ((uint32_t)5000U)      /* Time out for LSE start up, in ms */
#endif

#if !defined (EXTERNAL_CLOCK_VALUE)
  #define EXTERNAL_CLOCK_VALUE   ((uint32_t)12288000U)
#endif

/* ########################### System Configuration ######################### */
#define VDD_VALUE                ((uint32_t)3300U)        /* Value of VDD in mv */
#define TICK_INT_PRIORITY        ((uint32_t)0U)           /* tick interrupt priority */
#define USE_RTOS                 0U
#define PREFETCH_ENABLE          1U
#define INSTRUCTION_CACHE_ENABLE 1U
#define DATA_CACHE_ENABLE        1U

/* ########################## Assert Selection ############################## */
/* #define USE_FULL_ASSERT    1U */

/* ################## Ethernet peripheral configuration ##################### */
#define ETH_TX_DESC_CNT          4U
#define ETH_RX_DESC_CNT          4U
#define ETH_MAC_ADDR0            ((uint8_t)0x02U)
#define ETH_MAC_ADDR1            ((uint8_t)0x00U)
#define ETH_MAC_ADDR2            ((uint8_t)0x00U)
#define ETH_MAC_ADDR3            ((uint8_t)0x00U)
#define ETH_MAC_ADDR4            ((uint8_t)0x00U)
#define ETH_MAC_ADDR5            ((uint8_t)0x00U)

/* ################## SPI peripheral configuration ########################## */
#define USE_SPI_CRC              0U

/* Includes ----------------------------------------------------------------- */
#ifdef HAL_RCC_MODULE_ENABLED
  #include "stm32f4xx_hal_rcc.h"
#endif

#ifdef HAL_GPIO_MODULE_ENABLED
  #include "stm32f4xx_hal_gpio.h"
#endif

#ifdef HAL_DMA_MODULE_ENABLED
  #include "stm32f4xx_hal_dma.h"
#endif

#ifdef HAL_CORTEX_MODULE_ENABLED
  #include "stm32f4xx_hal_cortex.h"
#endif

#ifdef HAL_FLASH_MODULE_ENABLED
  #include "stm32f4xx_hal_flash.h"
#endif

#ifdef HAL_PWR_MODULE_ENABLED
  #include "stm32f4xx_hal_pwr.h"
#endif

#ifdef HAL_UART_MODULE_ENABLED
  #include "stm32f4xx_hal_uart.h"
#endif

#ifdef HAL_PCD_MODULE_ENABLED
  #include "stm32f4xx_hal_pcd.h"
#endif

/* Exported macro ----------------------------------------------------------- */
#ifdef USE_FULL_ASSERT
  #define assert_param(expr) ((expr) ? (void)0U : assert_failed((uint8_t *)__FILE__, __LINE__))
  void assert_failed(uint8_t *file, uint32_t line);
#else
  #define assert_param(expr) ((void)0U)
#endif

#ifdef __cplusplus
}
#endif

#endif /* __STM32F4xx_HAL_CONF_H */
